:PROPERTIES:
:ID:       ED17C5B4-4002-4CC0-9FD0-4A72FD845229
:header-args: :results output :session o365 :async :var venv="/tmp/o365" :python "/tmp/o365/bin/python"
:END:
#+title: office365

Office 365 is Microsoft's office suite.

Unsurpisingly, Office 365 does not seem to like xwidget webkit.

While I've warmed up to Microsoft over the years I still remain pretty
unlikely to adopt Office 365 of my own free will...but them's the
breaks. I've setup a personal free account to work with this notebook.

* Library Selection

** O365 (Nope)

Following search threads initially led me to the
https://github.com/O365/python-o365 library.

After kicking the tires a bit, I ended up moving off of it.  The
authentication wasn't quickly working (likely due to the many knobs
available on both ends), and when I started to dig through the code I
was left with concerns...some of which I also somewhat expected based
on the vibe of the code documentation (that seems unfair of me, but
the vibe was confirmed).

Overall the project doesn't align with my tastes...for something like
this I'd be particularly looking for some lightweight modeling on top
of fairly exposed API details, but the project instead felt like a
typical mass of relatively bloated and tangled OOP code - fairly poor
separation of concerns and even though it is focused on a single
platform (Office 365) it has the heft and indirection of something
striving to offer some kind of generalized functionality. If the code
had just worked I wouldn't have been bothered, but since it didn't
the details are not only contrary to my taste, but also got in the way
of jumping in to making things work.

** MSGraph SDK (Yup)

I subsequently chased down the SDK offered by Microsoft:
https://github.com/microsoftgraph/msgraph-sdk-python.

This is potentially slightly more hidden given that it is oriented
towards the Graph API rather than the services that run on top of
that. The code is seemingly designed similarly where most of the code
seems to be generated off of the API definition.

This is at least more closely aligned with the rest of the ecosystem
and so far the code seems what would be expected from that type of
generation configuration. While I'm sticking with python to start
(since I'll be using python for other things and its a good scripting
option), this should also allow for easier jumping to other runtimes
if warranted.

* Outlook?

This page does mention mail as another API.
https://learn.microsoft.com/en-us/entra/identity-platform/scopes-oidc
** Installation

* Installation

#+begin_src shell :session venv-setup :results output
  python3 -m venv ${venv}
  ${venv}/bin/python -m pip install msgraph-sdk
#+end_src

#+RESULTS:
#+begin_example
venv='/tmp/o365'
python3 -m venv ${venv}
${venv}/bin/python -m pip install msgraph-sdk
Requirement already satisfied: msgraph-sdk in /private/tmp/o365/lib/python3.14/site-packages (1.58.0)
Requirement already satisfied: azure-identity>=1.12.0 in /private/tmp/o365/lib/python3.14/site-packages (from msgraph-sdk) (1.25.3)
Requirement already satisfied: microsoft-kiota-serialization-json<2.0.0,>=1.8.0 in /private/tmp/o365/lib/python3.14/site-packages (from msgraph-sdk) (1.11.6)
Requirement already satisfied: microsoft-kiota-serialization-text<2.0.0,>=1.8.0 in /private/tmp/o365/lib/python3.14/site-packages (from msgraph-sdk) (1.11.6)
Requirement already satisfied: microsoft-kiota-serialization-form<2.0.0,>=1.8.0 in /private/tmp/o365/lib/python3.14/site-packages (from msgraph-sdk) (1.11.6)
Requirement already satisfied: microsoft-kiota-serialization-multipart<2.0.0,>=1.8.0 in /private/tmp/o365/lib/python3.14/site-packages (from msgraph-sdk) (1.11.6)
Requirement already satisfied: msgraph_core>=1.3.1 in /private/tmp/o365/lib/python3.14/site-packages (from msgraph-sdk) (1.4.0)
Requirement already satisfied: microsoft-kiota-abstractions<2.0.0,>=1.11.1 in /private/tmp/o365/lib/python3.14/site-packages (from microsoft-kiota-serialization-form<2.0.0,>=1.8.0->msgraph-sdk) (1.11.6)
Requirement already satisfied: std-uritemplate>=2.0.0 in /private/tmp/o365/lib/python3.14/site-packages (from microsoft-kiota-abstractions<2.0.0,>=1.11.1->microsoft-kiota-serialization-form<2.0.0,>=1.8.0->msgraph-sdk) (2.0.10)
Requirement already satisfied: opentelemetry-api>=1.27.0 in /private/tmp/o365/lib/python3.14/site-packages (from microsoft-kiota-abstractions<2.0.0,>=1.11.1->microsoft-kiota-serialization-form<2.0.0,>=1.8.0->msgraph-sdk) (1.43.0)
Requirement already satisfied: opentelemetry-sdk>=1.27.0 in /private/tmp/o365/lib/python3.14/site-packages (from microsoft-kiota-abstractions<2.0.0,>=1.11.1->microsoft-kiota-serialization-form<2.0.0,>=1.8.0->msgraph-sdk) (1.43.0)
Requirement already satisfied: azure-core>=1.31.0 in /private/tmp/o365/lib/python3.14/site-packages (from azure-identity>=1.12.0->msgraph-sdk) (1.41.0)
Requirement already satisfied: cryptography>=2.5 in /private/tmp/o365/lib/python3.14/site-packages (from azure-identity>=1.12.0->msgraph-sdk) (49.0.0)
Requirement already satisfied: msal>=1.35.1 in /private/tmp/o365/lib/python3.14/site-packages (from azure-identity>=1.12.0->msgraph-sdk) (1.37.0)
Requirement already satisfied: msal-extensions>=1.2.0 in /private/tmp/o365/lib/python3.14/site-packages (from azure-identity>=1.12.0->msgraph-sdk) (1.3.1)
Requirement already satisfied: typing-extensions>=4.0.0 in /private/tmp/o365/lib/python3.14/site-packages (from azure-identity>=1.12.0->msgraph-sdk) (4.15.0)
Requirement already satisfied: requests>=2.21.0 in /private/tmp/o365/lib/python3.14/site-packages (from azure-core>=1.31.0->azure-identity>=1.12.0->msgraph-sdk) (2.34.2)
Requirement already satisfied: cffi>=2.0.0 in /private/tmp/o365/lib/python3.14/site-packages (from cryptography>=2.5->azure-identity>=1.12.0->msgraph-sdk) (2.0.0)
Requirement already satisfied: pycparser in /private/tmp/o365/lib/python3.14/site-packages (from cffi>=2.0.0->cryptography>=2.5->azure-identity>=1.12.0->msgraph-sdk) (3.0)
Requirement already satisfied: PyJWT<3,>=1.0.0 in /private/tmp/o365/lib/python3.14/site-packages (from PyJWT[crypto]<3,>=1.0.0->msal>=1.35.1->azure-identity>=1.12.0->msgraph-sdk) (2.13.0)
Requirement already satisfied: charset_normalizer<4,>=2 in /private/tmp/o365/lib/python3.14/site-packages (from requests>=2.21.0->azure-core>=1.31.0->azure-identity>=1.12.0->msgraph-sdk) (3.4.7)
Requirement already satisfied: idna<4,>=2.5 in /private/tmp/o365/lib/python3.14/site-packages (from requests>=2.21.0->azure-core>=1.31.0->azure-identity>=1.12.0->msgraph-sdk) (3.18)
Requirement already satisfied: urllib3<3,>=1.26 in /private/tmp/o365/lib/python3.14/site-packages (from requests>=2.21.0->azure-core>=1.31.0->azure-identity>=1.12.0->msgraph-sdk) (2.7.0)
Requirement already satisfied: certifi>=2023.5.7 in /private/tmp/o365/lib/python3.14/site-packages (from requests>=2.21.0->azure-core>=1.31.0->azure-identity>=1.12.0->msgraph-sdk) (2026.6.17)
Requirement already satisfied: microsoft-kiota-authentication-azure<2.0.0,>=1.10.1 in /private/tmp/o365/lib/python3.14/site-packages (from msgraph_core>=1.3.1->msgraph-sdk) (1.11.6)
Requirement already satisfied: microsoft-kiota-http<2.0.0,>=1.10.1 in /private/tmp/o365/lib/python3.14/site-packages (from msgraph_core>=1.3.1->msgraph-sdk) (1.11.6)
Requirement already satisfied: httpx>=0.23.0 in /private/tmp/o365/lib/python3.14/site-packages (from httpx[http2]>=0.23.0->msgraph_core>=1.3.1->msgraph-sdk) (0.28.1)
Requirement already satisfied: aiohttp>=3.8.0 in /private/tmp/o365/lib/python3.14/site-packages (from microsoft-kiota-authentication-azure<2.0.0,>=1.10.1->msgraph_core>=1.3.1->msgraph-sdk) (3.14.1)
Requirement already satisfied: anyio in /private/tmp/o365/lib/python3.14/site-packages (from httpx>=0.23.0->httpx[http2]>=0.23.0->msgraph_core>=1.3.1->msgraph-sdk) (4.14.1)
Requirement already satisfied: httpcore==1.* in /private/tmp/o365/lib/python3.14/site-packages (from httpx>=0.23.0->httpx[http2]>=0.23.0->msgraph_core>=1.3.1->msgraph-sdk) (1.0.9)
Requirement already satisfied: h11>=0.16 in /private/tmp/o365/lib/python3.14/site-packages (from httpcore==1.*->httpx>=0.23.0->httpx[http2]>=0.23.0->msgraph_core>=1.3.1->msgraph-sdk) (0.16.0)
Requirement already satisfied: h2<5,>=3 in /private/tmp/o365/lib/python3.14/site-packages (from httpx[http2]>=0.23.0->msgraph_core>=1.3.1->msgraph-sdk) (4.3.0)
Requirement already satisfied: hyperframe<7,>=6.1 in /private/tmp/o365/lib/python3.14/site-packages (from h2<5,>=3->httpx[http2]>=0.23.0->msgraph_core>=1.3.1->msgraph-sdk) (6.1.0)
Requirement already satisfied: hpack<5,>=4.1 in /private/tmp/o365/lib/python3.14/site-packages (from h2<5,>=3->httpx[http2]>=0.23.0->msgraph_core>=1.3.1->msgraph-sdk) (4.2.0)
Requirement already satisfied: aiohappyeyeballs>=2.5.0 in /private/tmp/o365/lib/python3.14/site-packages (from aiohttp>=3.8.0->microsoft-kiota-authentication-azure<2.0.0,>=1.10.1->msgraph_core>=1.3.1->msgraph-sdk) (2.6.2)
Requirement already satisfied: aiosignal>=1.4.0 in /private/tmp/o365/lib/python3.14/site-packages (from aiohttp>=3.8.0->microsoft-kiota-authentication-azure<2.0.0,>=1.10.1->msgraph_core>=1.3.1->msgraph-sdk) (1.4.0)
Requirement already satisfied: attrs>=17.3.0 in /private/tmp/o365/lib/python3.14/site-packages (from aiohttp>=3.8.0->microsoft-kiota-authentication-azure<2.0.0,>=1.10.1->msgraph_core>=1.3.1->msgraph-sdk) (26.1.0)
Requirement already satisfied: frozenlist>=1.1.1 in /private/tmp/o365/lib/python3.14/site-packages (from aiohttp>=3.8.0->microsoft-kiota-authentication-azure<2.0.0,>=1.10.1->msgraph_core>=1.3.1->msgraph-sdk) (1.8.0)
Requirement already satisfied: multidict<7.0,>=4.5 in /private/tmp/o365/lib/python3.14/site-packages (from aiohttp>=3.8.0->microsoft-kiota-authentication-azure<2.0.0,>=1.10.1->msgraph_core>=1.3.1->msgraph-sdk) (6.7.1)
Requirement already satisfied: propcache>=0.2.0 in /private/tmp/o365/lib/python3.14/site-packages (from aiohttp>=3.8.0->microsoft-kiota-authentication-azure<2.0.0,>=1.10.1->msgraph_core>=1.3.1->msgraph-sdk) (0.5.2)
Requirement already satisfied: yarl<2.0,>=1.17.0 in /private/tmp/o365/lib/python3.14/site-packages (from aiohttp>=3.8.0->microsoft-kiota-authentication-azure<2.0.0,>=1.10.1->msgraph_core>=1.3.1->msgraph-sdk) (1.24.2)
Requirement already satisfied: opentelemetry-semantic-conventions==0.64b0 in /private/tmp/o365/lib/python3.14/site-packages (from opentelemetry-sdk>=1.27.0->microsoft-kiota-abstractions<2.0.0,>=1.11.1->microsoft-kiota-serialization-form<2.0.0,>=1.8.0->msgraph-sdk) (0.64b0)
[?2004hecho 'ob_comint_async_shell_end_7b072c34-6f25-40db-aae2-1fa1db90fe31'[?2004l
#+end_example

** azure

#+begin_src python
  help('modules azure')
#+end_src

#+RESULTS:
: Here is a list of modules whose name or summary contains 'azure'.
: If there are any, enter a module name to get more help.
: 
: kiota_authentication_azure - Authentication provider for Kiota using Azure Identity
: kiota_authentication_azure._exceptions 
: kiota_authentication_azure._version 
: kiota_authentication_azure.azure_identity_access_token_provider 
: kiota_authentication_azure.azure_identity_authentication_provider 
: msgraph_core.authentication.azure_identity_authentication_provider

** azure_identity_authentication_provider

#+begin_src python
  from msgraph_core.authentication import azure_identity_authentication_provider
  help(azure_identity_authentication_provider)
#+end_src

#+RESULTS:
#+begin_example
Help on module msgraph_core.authentication.azure_identity_authentication_provider in msgraph_core.authentication:

NAME
    msgraph_core.authentication.azure_identity_authentication_provider

CLASSES
    kiota_authentication_azure.azure_identity_authentication_provider.AzureIdentityAuthenticationProvider(kiota_abstractions.authentication.base_bearer_token_authentication_provider.BaseBearerTokenAuthenticationProvider)
        AzureIdentityAuthenticationProvider

    class AzureIdentityAuthenticationProvider(kiota_authentication_azure.azure_identity_authentication_provider.AzureIdentityAuthenticationProvider)
     |  AzureIdentityAuthenticationProvider(
     |      credentials: Union['TokenCredential', 'AsyncTokenCredential'],
     |      options: Optional[dict] = {},
     |      scopes: list[str] = [],
     |      allowed_hosts: list[str] = ['https://microsoftgraph.chinacloudapi.cn', 'https://graph.microsoft.de', 'https://graph.microsoft.com', 'https://dod-graph.microsoft.us', 'https://graph.microsoft.us']
     |  ) -> None
     |
     |  Method resolution order:
     |      AzureIdentityAuthenticationProvider
     |      kiota_authentication_azure.azure_identity_authentication_provider.AzureIdentityAuthenticationProvider
     |      kiota_abstractions.authentication.base_bearer_token_authentication_provider.BaseBearerTokenAuthenticationProvider
     |      kiota_abstractions.authentication.authentication_provider.AuthenticationProvider
     |      abc.ABC
     |      builtins.object
     |
     |  Methods defined here:
     |
     |  __init__(
     |      self,
     |      credentials: Union['TokenCredential', 'AsyncTokenCredential'],
     |      options: Optional[dict] = {},
     |      scopes: list[str] = [],
     |      allowed_hosts: list[str] = ['https://microsoftgraph.chinacloudapi.cn', 'https://graph.microsoft.de', 'https://graph.microsoft.com', 'https://dod-graph.microsoft.us', 'https://graph.microsoft.us']
     |  ) -> None
     |      [summary]
     |
     |      Args:
     |          credentials (Union["TokenCredential", "AsyncTokenCredential"]): The
     |              tokenCredential implementation to use for authentication.
     |          options (Optional[dict]): The options to use for authentication.
     |          scopes (list[str]): The scopes to use for authentication.
     |              Defaults to 'https://<national_cloud_domain>/.default'.
     |          allowed_hosts (Optional[list[str]]): The allowed hosts to use for
     |              authentication. Defaults to Microsoft National Clouds.
     |
     |  ----------------------------------------------------------------------
     |  Data and other attributes defined here:
     |
     |  __abstractmethods__ = frozenset()
     |
     |  ----------------------------------------------------------------------
     |  Methods inherited from kiota_abstractions.authentication.base_bearer_token_authentication_provider.BaseBearerTokenAuthenticationProvider:
     |
     |  async authenticate_request(
     |      self,
     |      request: RequestInformation,
     |      additional_authentication_context: dict[str, Any] = {}
     |  ) -> None
     |      Authenticates the provided RequestInformation instance using the provided
     |      authorization token
     |
     |      Args:
     |          request (RequestInformation): Request information object
     |
     |  ----------------------------------------------------------------------
     |  Data and other attributes inherited from kiota_abstractions.authentication.base_bearer_token_authentication_provider.BaseBearerTokenAuthenticationProvider:
     |
     |  AUTHORIZATION_HEADER = 'Authorization'
     |
     |  CLAIMS_KEY = 'claims'
     |
     |  ----------------------------------------------------------------------
     |  Data descriptors inherited from kiota_abstractions.authentication.authentication_provider.AuthenticationProvider:
     |
     |  __dict__
     |      dictionary for instance variables
     |
     |  __weakref__
     |      list of weak references to the object

DATA
    MS_DEFAULT_SCOPE = 'https://graph.microsoft.com/.default'
    Optional = typing.Optional
        Optional[X] is equivalent to X | None.

    TYPE_CHECKING = False

FILE
    /private/tmp/o365/lib/python3.14/site-packages/msgraph_core/authentication/azure_identity_authentication_provider.py
#+end_example

** msal

#+begin_src python
  help('modules msal')
#+end_src

#+RESULTS:
#+begin_example
Here is a list of modules whose name or summary contains 'msal'.
If there are any, enter a module name to get more help.

msal 
msal.__main__ - MSAL Python Tester
msal.application 
msal.auth_scheme 
msal.authority 
msal.broker - This module is an adaptor to the underlying broker.
msal.cloudshell - This module wraps Cloud Shell's IMDS-like interface inside an OAuth2-like helper
msal.exceptions 
msal.individual_cache 
msal.managed_identity 
msal.mex 
msal.oauth2cli 
msal.oauth2cli.assertion 
msal.oauth2cli.authcode - A one-stop helper for desktop app to acquire an authorization code.
msal.oauth2cli.http - This module documents the minimal http behaviors used by this package.
msal.oauth2cli.oauth2 - This OAuth2 client implementation aims to be spec-compliant, and generic.
msal.oauth2cli.oidc 
msal.region 
msal.sku - This module is from where we receive the client sku name and version.
msal.telemetry 
msal.throttled_http_client 
msal.token_cache 
msal.wstrust_request 
msal.wstrust_response 
msal_extensions - Provides auxiliary functionality to the `msal` package.
msal_extensions.cache_lock - Provides a mechanism for not competing with other processes interacting with an MSAL cache.
msal_extensions.filelock - A cross-process lock based on exclusive creation of a given file name
msal_extensions.libsecret - Implements a Linux specific TokenCache, and provides auxiliary helper types.
msal_extensions.osx - Implements a macOS specific TokenCache, and provides auxiliary helper types.
msal_extensions.persistence - A generic persistence layer, optionally encrypted on Windows, OSX, and Linux.
msal_extensions.token_cache - Generic functions and types for working with a TokenCache that is not platform specific.
msal_extensions.windows - Implements a Windows Specific TokenCache, and provides auxiliary helper types.
#+end_example

For whatever reason this doesn't seem to work.
Feels like something to dig into as part of [[id:0F78767D-42FF-4027-B3A2-26CA1898F788][obi]].

#+begin_src python :results output
  import msal
  help(msal)
#+end_src

#+RESULTS:
#+begin_example
Help on package msal:

NAME
    msal

DESCRIPTION
    #------------------------------------------------------------------------------
    #
    # Copyright (c) Microsoft Corporation.
    # All rights reserved.
    #
    # This code is licensed under the MIT License.
    #
    # Permission is hereby granted, free of charge, to any person obtaining a copy
    # of this software and associated documentation files(the "Software"), to deal
    # in the Software without restriction, including without limitation the rights
    # to use, copy, modify, merge, publish, distribute, sublicense, and / or sell
    # copies of the Software, and to permit persons to whom the Software is
    # furnished to do so, subject to the following conditions :
    #
    # The above copyright notice and this permission notice shall be included in
    # all copies or substantial portions of the Software.
    #
    # THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
    # IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
    # FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.IN NO EVENT SHALL THE
    # AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
    # LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
    # OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
    # THE SOFTWARE.
    #
    #------------------------------------------------------------------------------

PACKAGE CONTENTS
    __main__
    application
    auth_scheme
    authority
    broker
    cloudshell
    exceptions
    individual_cache
    managed_identity
    mex
    oauth2cli (package)
    region
    sku
    telemetry
    throttled_http_client
    token_cache
    wstrust_request
    wstrust_response

VERSION
    1.37.0

FILE
    /private/tmp/o365/lib/python3.14/site-packages/msal/__init__.py
#+end_example

** msgraph

#+begin_src python
  help('modules msgraph')
#+end_src

#+RESULTS:
#+begin_example
Here is a list of modules whose name or summary contains 'msgraph'.
If there are any, enter a module name to get more help.

msgraph - Python client for the Microsoft Graph API
msgraph._version 
msgraph.graph_request_adapter 
msgraph.graph_service_client 
msgraph_core - Core component of the Microsoft Graph Python SDK consisting of HTTP/Graph Client and a configurable middleware pipeline (Preview).
msgraph_core._constants - Application constants. All defaults can be changed when initializing a client
msgraph_core._enums 
msgraph_core.authentication 
msgraph_core.authentication.azure_identity_authentication_provider 
msgraph_core.base_graph_request_adapter 
msgraph_core.graph_client_factory 
msgraph_core.middleware 
msgraph_core.middleware.async_graph_transport 
msgraph_core.middleware.options 
msgraph_core.middleware.options.graph_telemetry_handler_option 
msgraph_core.middleware.request_context 
msgraph_core.middleware.telemetry 
msgraph_core.models 
msgraph_core.models.large_file_upload_session 
msgraph_core.models.page_result - This module defines the PageResult class which represents a page of
msgraph_core.models.upload_result 
msgraph_core.requests 
msgraph_core.requests.batch_request_builder 
msgraph_core.requests.batch_request_content 
msgraph_core.requests.batch_request_content_collection 
msgraph_core.requests.batch_request_item 
msgraph_core.requests.batch_response_content 
msgraph_core.requests.batch_response_content_collection 
msgraph_core.requests.batch_response_item 
msgraph_core.tasks 
msgraph_core.tasks.large_file_upload 
msgraph_core.tasks.page_iterator - This module contains the PageIterator class which is used to
#+end_example

#+begin_src python
  import msgraph
  help(msgraph)
#+end_src

#+RESULTS:
#+begin_example
Help on package msgraph:

NAME
    msgraph - Python client for the Microsoft Graph API

PACKAGE CONTENTS
    _version
    graph_request_adapter
    graph_service_client

SUBMODULES
    generated

DATA
    VERSION = '1.58.0'

VERSION
    1.58.0

FILE
    /private/tmp/o365/lib/python3.14/site-packages/msgraph/__init__.py
#+end_example

* Credentials

Credentials will be stored in the environment.

#+begin_src python
  from azure.identity import EnvironmentCredential
  help(EnvironmentCredential)
#+end_src

#+RESULTS:
#+begin_example
Help on class EnvironmentCredential in module azure.identity._credentials.environment:

class EnvironmentCredential(builtins.object)
 |  EnvironmentCredential(**kwargs: Any) -> None
 |
 |  A credential configured by environment variables.
 |
 |  This credential is capable of authenticating as a service principal using a client secret or a certificate.
 |  Configuration is attempted in this order, using these environment variables:
 |
 |  Service principal with secret:
 |    - **AZURE_TENANT_ID**: ID of the service principal's tenant. Also called its 'directory' ID.
 |    - **AZURE_CLIENT_ID**: the service principal's client ID
 |    - **AZURE_CLIENT_SECRET**: one of the service principal's client secrets
 |    - **AZURE_AUTHORITY_HOST**: authority of a Microsoft Entra endpoint, for example
 |      "login.microsoftonline.com", the authority for Azure Public Cloud, which is the default
 |      when no value is given.
 |
 |  Service principal with certificate:
 |    - **AZURE_TENANT_ID**: ID of the service principal's tenant. Also called its 'directory' ID.
 |    - **AZURE_CLIENT_ID**: the service principal's client ID
 |    - **AZURE_CLIENT_CERTIFICATE_PATH**: path to a PEM or PKCS12 certificate file including the private key.
 |    - **AZURE_CLIENT_CERTIFICATE_PASSWORD**: (optional) password of the certificate file, if any.
 |    - **AZURE_CLIENT_SEND_CERTIFICATE_CHAIN**: (optional) If True, the credential will send the public certificate
 |      chain in the x5c header of each token request's JWT. This is required for Subject Name/Issuer (SNI)
 |      authentication. Defaults to False.
 |    - **AZURE_AUTHORITY_HOST**: authority of a Microsoft Entra endpoint, for example
 |      "login.microsoftonline.com", the authority for Azure Public Cloud, which is the default
 |      when no value is given.
 |
 |  .. admonition:: Example:
 |
 |      .. literalinclude:: ../samples/credential_creation_code_snippets.py
 |          :start-after: [START create_environment_credential]
 |          :end-before: [END create_environment_credential]
 |          :language: python
 |          :dedent: 4
 |          :caption: Create an EnvironmentCredential.
 |
 |  Methods defined here:
 |
 |  __enter__(self) -> EnvironmentCredential
 |
 |  __exit__(self, *args: Any) -> None
 |
 |  __init__(self, **kwargs: Any) -> None
 |      Initialize self.  See help(type(self)) for accurate signature.
 |
 |  close(self) -> None
 |      Close the credential's transport session.
 |
 |  get_token(
 |      self,
 |      *scopes: str,
 |      claims: Optional[str] = None,
 |      tenant_id: Optional[str] = None,
 |      **kwargs: Any
 |  ) -> AccessToken
 |      Request an access token for `scopes`.
 |
 |      This method is called automatically by Azure SDK clients.
 |
 |      :param str scopes: desired scopes for the access token. This method requires at least one scope.
 |          For more information about scopes, see
 |          https://learn.microsoft.com/entra/identity-platform/scopes-oidc.
 |      :keyword str claims: additional claims required in the token, such as those returned in a resource provider's
 |          claims challenge following an authorization failure.
 |      :keyword str tenant_id: optional tenant to include in the token request.
 |
 |      :return: An access token with the desired scopes.
 |      :rtype: ~azure.core.credentials.AccessToken
 |
 |      :raises ~azure.identity.CredentialUnavailableError: environment variable configuration is incomplete
 |
 |  get_token_info(
 |      self,
 |      *scopes: str,
 |      options: Optional[TokenRequestOptions] = None
 |  ) -> AccessTokenInfo
 |      Request an access token for `scopes`.
 |
 |      This is an alternative to `get_token` to enable certain scenarios that require additional properties
 |      on the token. This method is called automatically by Azure SDK clients.
 |
 |      :param str scopes: desired scope for the access token. This method requires at least one scope.
 |          For more information about scopes, see https://learn.microsoft.com/entra/identity-platform/scopes-oidc.
 |      :keyword options: A dictionary of options for the token request. Unknown options will be ignored. Optional.
 |      :paramtype options: ~azure.core.credentials.TokenRequestOptions
 |
 |      :rtype: ~azure.core.credentials.AccessTokenInfo
 |      :return: An AccessTokenInfo instance containing information about the token.
 |
 |      :raises ~azure.identity.CredentialUnavailableError: environment variable configuration is incomplete.
 |
 |  ----------------------------------------------------------------------
 |  Data descriptors defined here:
 |
 |  __dict__
 |      dictionary for instance variables
 |
 |  __weakref__
 |      list of weak references to the object
#+end_example


** Setting up the Client

Navigate to https://entra.microsoft.com/#home
App Registrations


* msgraph

#+begin_src python :results output
  import msgraph
  help(msgraph)
#+end_src

#+RESULTS:
#+begin_example
Help on package msgraph:

NAME
    msgraph - Python client for the Microsoft Graph API

PACKAGE CONTENTS
    _version
    graph_request_adapter
    graph_service_client

SUBMODULES
    generated

DATA
    VERSION = '1.58.0'

VERSION
    1.58.0

FILE
    /private/tmp/o365/lib/python3.14/site-packages/msgraph/__init__.py
#+end_example

** graph_service_client

#+begin_src python :results output
  from msgraph import graph_service_client
  help(graph_service_client)
#+end_src

#+RESULTS:
#+begin_example
Help on module msgraph.graph_service_client in msgraph:

NAME
    msgraph.graph_service_client

DESCRIPTION
    # ------------------------------------
    # Copyright (c) Microsoft Corporation. All Rights Reserved.
    # Licensed under the MIT License.
    # See License in the project root for license information.
    # -----------------------------------

CLASSES
    msgraph.generated.base_graph_service_client.BaseGraphServiceClient(kiota_abstractions.base_request_builder.BaseRequestBuilder)
        GraphServiceClient

    class GraphServiceClient(msgraph.generated.base_graph_service_client.BaseGraphServiceClient)
     |  GraphServiceClient(
     |      credentials: Optional[Union[TokenCredential, AsyncTokenCredential]] = None,
     |      scopes: Optional[List[str]] = None,
     |      request_adapter: Optional[GraphRequestAdapter] = None
     |  ) -> None
     |
     |  Method resolution order:
     |      GraphServiceClient
     |      msgraph.generated.base_graph_service_client.BaseGraphServiceClient
     |      kiota_abstractions.base_request_builder.BaseRequestBuilder
     |      builtins.object
     |
     |  Methods defined here:
     |
     |  __init__(
     |      self,
     |      credentials: Optional[Union[TokenCredential, AsyncTokenCredential]] = None,
     |      scopes: Optional[List[str]] = None,
     |      request_adapter: Optional[GraphRequestAdapter] = None
     |  ) -> None
     |      Constructs a client instance to use for making requests to the
     |      Microsoft Graph v.1.0 API.
     |
     |      Args:
     |          credentials (Union[TokenCredential, AsyncTokenCredential]): The
     |          tokenCredential to use for authentication.
     |          scopes (Optional[List[str]]): The scopes to use for authentication.
     |          Defaults to ['https://graph.microsoft.com/.default'].
     |          request_adapter (Optional[GraphRequestAdapter], optional): The request
     |          adapter to use for requests. Defaults to None.
     |
     |  ----------------------------------------------------------------------
     |  Readonly properties defined here:
     |
     |  batch
     |      Returns a BatchRequestBuilder to enable batch requests.
     |
     |  me
     |      Maps requests to /me endpoint to /users/{{user-id}}
     |
     |  ----------------------------------------------------------------------
     |  Methods inherited from msgraph.generated.base_graph_service_client.BaseGraphServiceClient:
     |
     |  applications_with_app_id(self, app_id: str) -> ApplicationsWithAppIdRequestBuilder
     |      Provides operations to manage the collection of application entities.
     |      param app_id: Alternate key of application
     |      Returns: ApplicationsWithAppIdRequestBuilder
     |
     |  applications_with_unique_name(self, unique_name: str) -> ApplicationsWithUniqueNameRequestBuilder
     |      Provides operations to manage the collection of application entities.
     |      param unique_name: Alternate key of application
     |      Returns: ApplicationsWithUniqueNameRequestBuilder
     |
     |  devices_with_device_id(self, device_id: str) -> DevicesWithDeviceIdRequestBuilder
     |      Provides operations to manage the collection of device entities.
     |      param device_id: Alternate key of device
     |      Returns: DevicesWithDeviceIdRequestBuilder
     |
     |  directory_roles_with_role_template_id(self, role_template_id: str) -> DirectoryRolesWithRoleTemplateIdRequestBuilder
     |      Provides operations to manage the collection of directoryRole entities.
     |      param role_template_id: Alternate key of directoryRole
     |      Returns: DirectoryRolesWithRoleTemplateIdRequestBuilder
     |
     |  groups_with_unique_name(self, unique_name: str) -> GroupsWithUniqueNameRequestBuilder
     |      Provides operations to manage the collection of group entities.
     |      param unique_name: Alternate key of group
     |      Returns: GroupsWithUniqueNameRequestBuilder
     |
     |  service_principals_with_app_id(self, app_id: str) -> ServicePrincipalsWithAppIdRequestBuilder
     |      Provides operations to manage the collection of servicePrincipal entities.
     |      param app_id: Alternate key of servicePrincipal
     |      Returns: ServicePrincipalsWithAppIdRequestBuilder
     |
     |  users_with_user_principal_name(self, user_principal_name: str) -> UsersWithUserPrincipalNameRequestBuilder
     |      Provides operations to manage the collection of user entities.
     |      param user_principal_name: Alternate key of user
     |      Returns: UsersWithUserPrincipalNameRequestBuilder
     |
     |  ----------------------------------------------------------------------
     |  Readonly properties inherited from msgraph.generated.base_graph_service_client.BaseGraphServiceClient:
     |
     |  admin
     |      Provides operations to manage the admin singleton.
     |
     |  agreement_acceptances
     |      Provides operations to manage the collection of agreementAcceptance entities.
     |
     |  agreements
     |      Provides operations to manage the collection of agreement entities.
     |
     |  app_catalogs
     |      Provides operations to manage the appCatalogs singleton.
     |
     |  application_templates
     |      Provides operations to manage the collection of applicationTemplate entities.
     |
     |  applications
     |      Provides operations to manage the collection of application entities.
     |
     |  audit_logs
     |      Provides operations to manage the auditLogRoot singleton.
     |
     |  authentication_method_configurations
     |      Provides operations to manage the collection of authenticationMethodConfiguration entities.
     |
     |  authentication_methods_policy
     |      Provides operations to manage the authenticationMethodsPolicy singleton.
     |
     |  certificate_based_auth_configuration
     |      Provides operations to manage the collection of certificateBasedAuthConfiguration entities.
     |
     |  chats
     |      Provides operations to manage the collection of chat entities.
     |
     |  communications
     |      Provides operations to manage the cloudCommunications singleton.
     |
     |  compliance
     |      Provides operations to manage the compliance singleton.
     |
     |  connections
     |      Provides operations to manage the collection of externalConnection entities.
     |
     |  contacts
     |      Provides operations to manage the collection of orgContact entities.
     |
     |  contracts
     |      Provides operations to manage the collection of contract entities.
     |
     |  data_policy_operations
     |      Provides operations to manage the collection of dataPolicyOperation entities.
     |
     |  device_app_management
     |      Provides operations to manage the deviceAppManagement singleton.
     |
     |  device_management
     |      Provides operations to manage the deviceManagement singleton.
     |
     |  devices
     |      Provides operations to manage the collection of device entities.
     |
     |  directory
     |      Provides operations to manage the directory singleton.
     |
     |  directory_objects
     |      Provides operations to manage the collection of directoryObject entities.
     |
     |  directory_role_templates
     |      Provides operations to manage the collection of directoryRoleTemplate entities.
     |
     |  directory_roles
     |      Provides operations to manage the collection of directoryRole entities.
     |
     |  domain_dns_records
     |      Provides operations to manage the collection of domainDnsRecord entities.
     |
     |  domains
     |      Provides operations to manage the collection of domain entities.
     |
     |  drives
     |      Provides operations to manage the collection of drive entities.
     |
     |  education
     |      Provides operations to manage the educationRoot singleton.
     |
     |  employee_experience
     |      Provides operations to manage the employeeExperience singleton.
     |
     |  external
     |      Provides operations to manage the external singleton.
     |
     |  filter_operators
     |      Provides operations to manage the collection of filterOperatorSchema entities.
     |
     |  functions
     |      Provides operations to manage the collection of attributeMappingFunctionSchema entities.
     |
     |  group_lifecycle_policies
     |      Provides operations to manage the collection of groupLifecyclePolicy entities.
     |
     |  group_setting_templates
     |      Provides operations to manage the collection of groupSettingTemplate entities.
     |
     |  group_settings
     |      Provides operations to manage the collection of groupSetting entities.
     |
     |  groups
     |      Provides operations to manage the collection of group entities.
     |
     |  identity
     |      Provides operations to manage the identityContainer singleton.
     |
     |  identity_governance
     |      Provides operations to manage the identityGovernance singleton.
     |
     |  identity_protection
     |      Provides operations to manage the identityProtectionRoot singleton.
     |
     |  identity_providers
     |      Provides operations to manage the collection of identityProvider entities.
     |
     |  information_protection
     |      Provides operations to manage the informationProtection singleton.
     |
     |  invitations
     |      Provides operations to manage the collection of invitation entities.
     |
     |  oauth2_permission_grants
     |      Provides operations to manage the collection of oAuth2PermissionGrant entities.
     |
     |  organization
     |      Provides operations to manage the collection of organization entities.
     |
     |  permission_grants
     |      Provides operations to manage the collection of resourceSpecificPermissionGrant entities.
     |
     |  places
     |      Provides operations to manage the collection of place entities.
     |
     |  planner
     |      Provides operations to manage the planner singleton.
     |
     |  policies
     |      Provides operations to manage the policyRoot singleton.
     |
     |  print
     |      Provides operations to manage the print singleton.
     |
     |  privacy
     |      Provides operations to manage the privacy singleton.
     |
     |  reports
     |      Provides operations to manage the reportRoot singleton.
     |
     |  role_management
     |      Provides operations to manage the roleManagement singleton.
     |
     |  schema_extensions
     |      Provides operations to manage the collection of schemaExtension entities.
     |
     |  scoped_role_memberships
     |      Provides operations to manage the collection of scopedRoleMembership entities.
     |
     |  search
     |      Provides operations to manage the searchEntity singleton.
     |
     |  security
     |      Provides operations to manage the security singleton.
     |
     |  service_principals
     |      Provides operations to manage the collection of servicePrincipal entities.
     |
     |  shares
     |      Provides operations to manage the collection of sharedDriveItem entities.
     |
     |  sites
     |      Provides operations to manage the collection of site entities.
     |
     |  solutions
     |      Provides operations to manage the solutionsRoot singleton.
     |
     |  storage
     |      Provides operations to manage the storage singleton.
     |
     |  subscribed_skus
     |      Provides operations to manage the collection of subscribedSku entities.
     |
     |  subscriptions
     |      Provides operations to manage the collection of subscription entities.
     |
     |  teams
     |      Provides operations to manage the collection of team entities.
     |
     |  teams_templates
     |      Provides operations to manage the collection of teamsTemplate entities.
     |
     |  teamwork
     |      Provides operations to manage the teamwork singleton.
     |
     |  tenant_relationships
     |      Provides operations to manage the tenantRelationship singleton.
     |
     |  users
     |      Provides operations to manage the collection of user entities.
     |
     |  ----------------------------------------------------------------------
     |  Data descriptors inherited from kiota_abstractions.base_request_builder.BaseRequestBuilder:
     |
     |  __dict__
     |      dictionary for instance variables
     |
     |  __weakref__
     |      list of weak references to the object

DATA
    List = typing.List
        Deprecated alias to list.

    Optional = typing.Optional
        Optional[X] is equivalent to X | None.

    TYPE_CHECKING = False

FILE
    /private/tmp/o365/lib/python3.14/site-packages/msgraph/graph_service_client.py
#+end_example

** BaseGraphServiceClient

#+begin_src python :results output
  from msgraph.generated import base_graph_service_client 
  help(base_graph_service_client)
#+end_src

#+RESULTS:
#+begin_example
Help on module msgraph.generated.base_graph_service_client in msgraph.generated:

NAME
    msgraph.generated.base_graph_service_client

CLASSES
    kiota_abstractions.base_request_builder.BaseRequestBuilder(builtins.object)
        BaseGraphServiceClient

    class BaseGraphServiceClient(kiota_abstractions.base_request_builder.BaseRequestBuilder)
     |  BaseGraphServiceClient(
     |      request_adapter: RequestAdapter,
     |      backing_store: Optional[BackingStoreFactory] = None
     |  ) -> None
     |
     |  The main entry point of the SDK, exposes the configuration and the fluent API.
     |
     |  Method resolution order:
     |      BaseGraphServiceClient
     |      kiota_abstractions.base_request_builder.BaseRequestBuilder
     |      builtins.object
     |
     |  Methods defined here:
     |
     |  __init__(
     |      self,
     |      request_adapter: RequestAdapter,
     |      backing_store: Optional[BackingStoreFactory] = None
     |  ) -> None
     |      Instantiates a new BaseGraphServiceClient and sets the default values.
     |      param backing_store: The backing store to use for the models.
     |      param request_adapter: The request adapter to use to execute the requests.
     |      Returns: None
     |
     |  applications_with_app_id(self, app_id: str) -> ApplicationsWithAppIdRequestBuilder
     |      Provides operations to manage the collection of application entities.
     |      param app_id: Alternate key of application
     |      Returns: ApplicationsWithAppIdRequestBuilder
     |
     |  applications_with_unique_name(self, unique_name: str) -> ApplicationsWithUniqueNameRequestBuilder
     |      Provides operations to manage the collection of application entities.
     |      param unique_name: Alternate key of application
     |      Returns: ApplicationsWithUniqueNameRequestBuilder
     |
     |  devices_with_device_id(self, device_id: str) -> DevicesWithDeviceIdRequestBuilder
     |      Provides operations to manage the collection of device entities.
     |      param device_id: Alternate key of device
     |      Returns: DevicesWithDeviceIdRequestBuilder
     |
     |  directory_roles_with_role_template_id(self, role_template_id: str) -> DirectoryRolesWithRoleTemplateIdRequestBuilder
     |      Provides operations to manage the collection of directoryRole entities.
     |      param role_template_id: Alternate key of directoryRole
     |      Returns: DirectoryRolesWithRoleTemplateIdRequestBuilder
     |
     |  groups_with_unique_name(self, unique_name: str) -> GroupsWithUniqueNameRequestBuilder
     |      Provides operations to manage the collection of group entities.
     |      param unique_name: Alternate key of group
     |      Returns: GroupsWithUniqueNameRequestBuilder
     |
     |  service_principals_with_app_id(self, app_id: str) -> ServicePrincipalsWithAppIdRequestBuilder
     |      Provides operations to manage the collection of servicePrincipal entities.
     |      param app_id: Alternate key of servicePrincipal
     |      Returns: ServicePrincipalsWithAppIdRequestBuilder
     |
     |  users_with_user_principal_name(self, user_principal_name: str) -> UsersWithUserPrincipalNameRequestBuilder
     |      Provides operations to manage the collection of user entities.
     |      param user_principal_name: Alternate key of user
     |      Returns: UsersWithUserPrincipalNameRequestBuilder
     |
     |  ----------------------------------------------------------------------
     |  Readonly properties defined here:
     |
     |  admin
     |      Provides operations to manage the admin singleton.
     |
     |  agreement_acceptances
     |      Provides operations to manage the collection of agreementAcceptance entities.
     |
     |  agreements
     |      Provides operations to manage the collection of agreement entities.
     |
     |  app_catalogs
     |      Provides operations to manage the appCatalogs singleton.
     |
     |  application_templates
     |      Provides operations to manage the collection of applicationTemplate entities.
     |
     |  applications
     |      Provides operations to manage the collection of application entities.
     |
     |  audit_logs
     |      Provides operations to manage the auditLogRoot singleton.
     |
     |  authentication_method_configurations
     |      Provides operations to manage the collection of authenticationMethodConfiguration entities.
     |
     |  authentication_methods_policy
     |      Provides operations to manage the authenticationMethodsPolicy singleton.
     |
     |  certificate_based_auth_configuration
     |      Provides operations to manage the collection of certificateBasedAuthConfiguration entities.
     |
     |  chats
     |      Provides operations to manage the collection of chat entities.
     |
     |  communications
     |      Provides operations to manage the cloudCommunications singleton.
     |
     |  compliance
     |      Provides operations to manage the compliance singleton.
     |
     |  connections
     |      Provides operations to manage the collection of externalConnection entities.
     |
     |  contacts
     |      Provides operations to manage the collection of orgContact entities.
     |
     |  contracts
     |      Provides operations to manage the collection of contract entities.
     |
     |  data_policy_operations
     |      Provides operations to manage the collection of dataPolicyOperation entities.
     |
     |  device_app_management
     |      Provides operations to manage the deviceAppManagement singleton.
     |
     |  device_management
     |      Provides operations to manage the deviceManagement singleton.
     |
     |  devices
     |      Provides operations to manage the collection of device entities.
     |
     |  directory
     |      Provides operations to manage the directory singleton.
     |
     |  directory_objects
     |      Provides operations to manage the collection of directoryObject entities.
     |
     |  directory_role_templates
     |      Provides operations to manage the collection of directoryRoleTemplate entities.
     |
     |  directory_roles
     |      Provides operations to manage the collection of directoryRole entities.
     |
     |  domain_dns_records
     |      Provides operations to manage the collection of domainDnsRecord entities.
     |
     |  domains
     |      Provides operations to manage the collection of domain entities.
     |
     |  drives
     |      Provides operations to manage the collection of drive entities.
     |
     |  education
     |      Provides operations to manage the educationRoot singleton.
     |
     |  employee_experience
     |      Provides operations to manage the employeeExperience singleton.
     |
     |  external
     |      Provides operations to manage the external singleton.
     |
     |  filter_operators
     |      Provides operations to manage the collection of filterOperatorSchema entities.
     |
     |  functions
     |      Provides operations to manage the collection of attributeMappingFunctionSchema entities.
     |
     |  group_lifecycle_policies
     |      Provides operations to manage the collection of groupLifecyclePolicy entities.
     |
     |  group_setting_templates
     |      Provides operations to manage the collection of groupSettingTemplate entities.
     |
     |  group_settings
     |      Provides operations to manage the collection of groupSetting entities.
     |
     |  groups
     |      Provides operations to manage the collection of group entities.
     |
     |  identity
     |      Provides operations to manage the identityContainer singleton.
     |
     |  identity_governance
     |      Provides operations to manage the identityGovernance singleton.
     |
     |  identity_protection
     |      Provides operations to manage the identityProtectionRoot singleton.
     |
     |  identity_providers
     |      Provides operations to manage the collection of identityProvider entities.
     |
     |  information_protection
     |      Provides operations to manage the informationProtection singleton.
     |
     |  invitations
     |      Provides operations to manage the collection of invitation entities.
     |
     |  oauth2_permission_grants
     |      Provides operations to manage the collection of oAuth2PermissionGrant entities.
     |
     |  organization
     |      Provides operations to manage the collection of organization entities.
     |
     |  permission_grants
     |      Provides operations to manage the collection of resourceSpecificPermissionGrant entities.
     |
     |  places
     |      Provides operations to manage the collection of place entities.
     |
     |  planner
     |      Provides operations to manage the planner singleton.
     |
     |  policies
     |      Provides operations to manage the policyRoot singleton.
     |
     |  print
     |      Provides operations to manage the print singleton.
     |
     |  privacy
     |      Provides operations to manage the privacy singleton.
     |
     |  reports
     |      Provides operations to manage the reportRoot singleton.
     |
     |  role_management
     |      Provides operations to manage the roleManagement singleton.
     |
     |  schema_extensions
     |      Provides operations to manage the collection of schemaExtension entities.
     |
     |  scoped_role_memberships
     |      Provides operations to manage the collection of scopedRoleMembership entities.
     |
     |  search
     |      Provides operations to manage the searchEntity singleton.
     |
     |  security
     |      Provides operations to manage the security singleton.
     |
     |  service_principals
     |      Provides operations to manage the collection of servicePrincipal entities.
     |
     |  shares
     |      Provides operations to manage the collection of sharedDriveItem entities.
     |
     |  sites
     |      Provides operations to manage the collection of site entities.
     |
     |  solutions
     |      Provides operations to manage the solutionsRoot singleton.
     |
     |  storage
     |      Provides operations to manage the storage singleton.
     |
     |  subscribed_skus
     |      Provides operations to manage the collection of subscribedSku entities.
     |
     |  subscriptions
     |      Provides operations to manage the collection of subscription entities.
     |
     |  teams
     |      Provides operations to manage the collection of team entities.
     |
     |  teams_templates
     |      Provides operations to manage the collection of teamsTemplate entities.
     |
     |  teamwork
     |      Provides operations to manage the teamwork singleton.
     |
     |  tenant_relationships
     |      Provides operations to manage the tenantRelationship singleton.
     |
     |  users
     |      Provides operations to manage the collection of user entities.
     |
     |  ----------------------------------------------------------------------
     |  Data descriptors inherited from kiota_abstractions.base_request_builder.BaseRequestBuilder:
     |
     |  __dict__
     |      dictionary for instance variables
     |
     |  __weakref__
     |      list of weak references to the object

DATA
    Optional = typing.Optional
        Optional[X] is equivalent to X | None.

    TYPE_CHECKING = False

FILE
    /private/tmp/o365/lib/python3.14/site-packages/msgraph/generated/base_graph_service_client.py
#+end_example

** Inspecting Operations

The generated properties appear to only be populated on instantiation,
so help can be collected from instances.

For example:
#+begin_src python :results output
  from msgraph import GraphServiceClient
  from azure.identity import EnvironmentCredential

  credential = EnvironmentCredential()

  scopes = ['https://graph.microsoft.com/.default']
  client = GraphServiceClient(credentials=credential, scopes=scopes)

  help(client.users)
#+end_src

*** generated

#+begin_src python :results output
  from msgraph import generated
  help(generated)
#+end_src

#+RESULTS:
#+begin_example
Help on package msgraph.generated in msgraph:

NAME
    msgraph.generated

PACKAGE CONTENTS
    base_graph_service_client

SUBMODULES
    users

FILE
    (built-in)
#+end_example

**** users

#+begin_src python :results output
  from msgraph.generated.users import users_request_builder
  help(users_request_builder)
#+end_src

#+RESULTS:
#+begin_example
Help on module msgraph.generated.users.users_request_builder in msgraph.generated.users:

NAME
    msgraph.generated.users.users_request_builder

CLASSES
    kiota_abstractions.base_request_builder.BaseRequestBuilder(builtins.object)
        UsersRequestBuilder

    class UsersRequestBuilder(kiota_abstractions.base_request_builder.BaseRequestBuilder)
     |  UsersRequestBuilder(
     |      request_adapter: RequestAdapter,
     |      path_parameters: Union[str, dict[str, Any]]
     |  ) -> None
     |
     |  Provides operations to manage the collection of user entities.
     |
     |  Method resolution order:
     |      UsersRequestBuilder
     |      kiota_abstractions.base_request_builder.BaseRequestBuilder
     |      builtins.object
     |
     |  Methods defined here:
     |
     |  __init__(
     |      self,
     |      request_adapter: RequestAdapter,
     |      path_parameters: Union[str, dict[str, Any]]
     |  ) -> None
     |      Instantiates a new UsersRequestBuilder and sets the default values.
     |      param path_parameters: The raw url or the url-template parameters for the request.
     |      param request_adapter: The request adapter to use to execute the requests.
     |      Returns: None
     |
     |  by_user_id(self, user_id: str) -> UserItemRequestBuilder
     |      Provides operations to manage the collection of user entities.
     |      param user_id: The unique identifier of user
     |      Returns: UserItemRequestBuilder
     |
     |  async get(
     |      self,
     |      request_configuration: Optional[RequestConfiguration[UsersRequestBuilderGetQueryParameters]] = None
     |  ) -> Optional[UserCollectionResponse]
     |      Retrieve a list of user objects.
     |      param request_configuration: Configuration for the request such as headers, query parameters, and middleware options.
     |      Returns: Optional[UserCollectionResponse]
     |      Find more info here: https://learn.microsoft.com/graph/api/user-list?view=graph-rest-1.0
     |
     |  async post(
     |      self,
     |      body: User,
     |      request_configuration: Optional[RequestConfiguration[QueryParameters]] = None
     |  ) -> Optional[User]
     |      Create a new user.The request body contains the user to create. At a minimum, you must specify the required properties for the user. You can optionally specify any other writable properties.
     |      param body: The request body
     |      param request_configuration: Configuration for the request such as headers, query parameters, and middleware options.
     |      Returns: Optional[User]
     |      Find more info here: https://learn.microsoft.com/graph/api/user-post-users?view=graph-rest-1.0
     |
     |  to_get_request_information(
     |      self,
     |      request_configuration: Optional[RequestConfiguration[UsersRequestBuilderGetQueryParameters]] = None
     |  ) -> RequestInformation
     |      Retrieve a list of user objects.
     |      param request_configuration: Configuration for the request such as headers, query parameters, and middleware options.
     |      Returns: RequestInformation
     |
     |  to_post_request_information(
     |      self,
     |      body: User,
     |      request_configuration: Optional[RequestConfiguration[QueryParameters]] = None
     |  ) -> RequestInformation
     |      Create a new user.The request body contains the user to create. At a minimum, you must specify the required properties for the user. You can optionally specify any other writable properties.
     |      param body: The request body
     |      param request_configuration: Configuration for the request such as headers, query parameters, and middleware options.
     |      Returns: RequestInformation
     |
     |  with_url(self, raw_url: str) -> UsersRequestBuilder
     |      Returns a request builder with the provided arbitrary URL. Using this method means any other path or query parameters are ignored.
     |      param raw_url: The raw URL to use for the request builder.
     |      Returns: UsersRequestBuilder
     |
     |  ----------------------------------------------------------------------
     |  Readonly properties defined here:
     |
     |  count
     |      Provides operations to count the resources in the collection.
     |
     |  delta
     |      Provides operations to call the delta method.
     |
     |  get_available_extension_properties
     |      Provides operations to call the getAvailableExtensionProperties method.
     |
     |  get_by_ids
     |      Provides operations to call the getByIds method.
     |
     |  validate_properties
     |      Provides operations to call the validateProperties method.
     |
     |  ----------------------------------------------------------------------
     |  Data and other attributes defined here:
     |
     |  UsersRequestBuilderGetQueryParameters = <class 'msgraph.generated.user...
     |      Retrieve a list of user objects.
     |
     |
     |  UsersRequestBuilderGetRequestConfiguration = <class 'msgraph.generated...
     |      Configuration for the request such as headers, query parameters, and middleware options.
     |
     |
     |  UsersRequestBuilderPostRequestConfiguration = <class 'msgraph.generate...
     |      Configuration for the request such as headers, query parameters, and middleware options.
     |
     |
     |  ----------------------------------------------------------------------
     |  Data descriptors inherited from kiota_abstractions.base_request_builder.BaseRequestBuilder:
     |
     |  __dict__
     |      dictionary for instance variables
     |
     |  __weakref__
     |      list of weak references to the object

FUNCTIONS
    warn(message, category=None, stacklevel=1, source=None, *,
         skip_file_prefixes=<unrepresentable>)
        Issue a warning, or maybe ignore it or raise an exception.

        message
          Text of the warning message.
        category
          The Warning category subclass. Defaults to UserWarning.
        stacklevel
          How far up the call stack to make this warning appear. A value of 2 for
          example attributes the warning to the caller of the code calling warn().
        source
          If supplied, the destroyed object which emitted a ResourceWarning
        skip_file_prefixes
          An optional tuple of module filename prefixes indicating frames to skip
          during stacklevel computations for stack frame attribution.

DATA
    Optional = typing.Optional
        Optional[X] is equivalent to X | None.

    TYPE_CHECKING = False
    __warningregistry__ = {'version': 10}

FILE
    /private/tmp/o365/lib/python3.14/site-packages/msgraph/generated/users/users_request_builder.py
#+end_example
* Try Example

This is finally working...

I changed the redirect url and maybe that did the trick.
Also make sure to add the right permissions in the right mode.


#+begin_src python
  import asyncio

  from msgraph import GraphServiceClient
  from azure.identity import EnvironmentCredential

  credential = EnvironmentCredential()

  scopes = ['https://graph.microsoft.com/.default']
  client = GraphServiceClient(credentials=credential, scopes=scopes)
  print(dir(client))
  async def get_user():
      user = await client.users.by_user_id('4c5587fc-957b-41e8-be8b-f54331deb9b5').get()

      if user:
          print(user.user_principal_name, user.display_name, user.id)
  async def messages():
      user = await client.users.by_user_id('4c5587fc-957b-41e8-be8b-f54331deb9b5').calendar.get()

      if user:
          print(user)
  async def me():
      me = await client.me.get()
      if me:
          print(me.display_name)
  asyncio.run(messages())
#+end_src

#+RESULTS:
: 46e3a1e3-945a-4ac9-aa9e-3cc7a2eb7678

** List Properties

#+begin_src python
  print(dir(client))
#+end_src

#+RESULTS:
: ['__class__', '__delattr__', '__dict__', '__dir__', '__doc__', '__eq__', '__firstlineno__', '__format__', '__ge__', '__getattribute__', '__getstate__', '__gt__', '__hash__', '__init__', '__init_subclass__', '__le__', '__lt__', '__module__', '__ne__', '__new__', '__reduce__', '__reduce_ex__', '__repr__', '__setattr__', '__sizeof__', '__static_attributes__', '__str__', '__subclasshook__', '__weakref__', 'admin', 'agreement_acceptances', 'agreements', 'app_catalogs', 'application_templates', 'applications', 'applications_with_app_id', 'applications_with_unique_name', 'audit_logs', 'authentication_method_configurations', 'authentication_methods_policy', 'batch', 'certificate_based_auth_configuration', 'chats', 'communications', 'compliance', 'connections', 'contacts', 'contracts', 'data_policy_operations', 'device_app_management', 'device_management', 'devices', 'devices_with_device_id', 'directory', 'directory_objects', 'directory_role_templates', 'directory_roles', 'directory_roles_with_role_template_id', 'domain_dns_records', 'domains', 'drives', 'education', 'employee_experience', 'external', 'filter_operators', 'functions', 'group_lifecycle_policies', 'group_setting_templates', 'group_settings', 'groups', 'groups_with_unique_name', 'identity', 'identity_governance', 'identity_protection', 'identity_providers', 'information_protection', 'invitations', 'me', 'oauth2_permission_grants', 'organization', 'path_parameters', 'permission_grants', 'places', 'planner', 'policies', 'print', 'privacy', 'reports', 'request_adapter', 'role_management', 'schema_extensions', 'scoped_role_memberships', 'search', 'security', 'service_principals', 'service_principals_with_app_id', 'shares', 'sites', 'solutions', 'storage', 'subscribed_skus', 'subscriptions', 'teams', 'teams_templates', 'teamwork', 'tenant_relationships', 'url_template', 'users', 'users_with_user_principal_name']

  app = msal.ConfidentialClientApplication(
    client_id, authority=f"https://login.microsoftonline.com/{tenant_id}",
    client_credential=client_secret)
  result = app.acquire_token_silent(scopes, account=None)

  if not result:
    result = app.acquire_token_for_client(scopes)
  print(result)


: {'token_type': 'Bearer', 'expires_in': 3599, 'ext_expires_in': 3599, 'access_token': 'eyJ0eXAiOiJKV1QiLCJub25jZSI6Ill1d090aHBUU0oyTUlkZUsxMXRQZkI3SWNMcUxrdHgzOTBQNFRsc0VlZFUiLCJhbGciOiJSUzI1NiIsIng1dCI6IndoMDZzRWt6TEhKNXNOTmFVeVJZMl82TzhLMCIsImtpZCI6IndoMDZzRWt6TEhKNXNOTmFVeVJZMl82TzhLMCJ9.eyJhdWQiOiJodHRwczovL2dyYXBoLm1pY3Jvc29mdC5jb20iLCJpc3MiOiJodHRwczovL3N0cy53aW5kb3dzLm5ldC9mNDA2MzIzMC04MTliLTRmYTMtOGQzMC1jY2VkNDliOTJjMDgvIiwiaWF0IjoxNzgxNTY1MTA5LCJuYmYiOjE3ODE1NjUxMDksImV4cCI6MTc4MTU2OTAwOSwiYWNycyI6WyJwZmRyIl0sImFpbyI6IkFTUUEyLzhjQUFBQUkwS3pERzFTNG94Qnkwd216N1BWZzVOM3V2aXJGRU45M1pDaXJlb2RGd0k9IiwiYXBwX2Rpc3BsYXluYW1lIjoiY2xpIiwiYXBwaWQiOiJjMmJjZTY2Ny02ZDhiLTRhNGEtODU1MS0wYTJjN2RhNDQ1YTYiLCJhcHBpZGFjciI6IjEiLCJpZHAiOiJodHRwczovL3N0cy53aW5kb3dzLm5ldC9mNDA2MzIzMC04MTliLTRmYTMtOGQzMC1jY2VkNDliOTJjMDgvIiwiaWR0eXAiOiJhcHAiLCJvaWQiOiI2N2NjYjAxNC00MDRiLTQ2ZDgtODEwNC0zOTZlYmQzMGMzYTYiLCJyaCI6IjEuQVc4Qk1ESUc5SnVCbzAtTk1NenRTYmtzQ0FNQUFBQUFBQUFBd0FBQUFBQUFBQUFBQUFCdkFRLiIsInJvbGVzIjpbIlVzZXIuUmVhZC5BbGwiXSwic3ViIjoiNjdjY2IwMTQtNDA0Yi00NmQ4LTgxMDQtMzk2ZWJkMzBjM2E2IiwidGVuYW50X3JlZ2lvbl9zY29wZSI6Ik5BIiwidGlkIjoiZjQwNjMyMzAtODE5Yi00ZmEzLThkMzAtY2NlZDQ5YjkyYzA4IiwidXRpIjoiOUp1c1kyR21TMEdZaHdWNk1OSTBBQSIsInZlciI6IjEuMCIsIndpZHMiOlsiMDk5N2ExZDAtMGQxZC00YWNiLWI0MDgtZDVjYTczMTIxZTkwIl0sInhtc19hY2QiOjE3ODE1NDMwOTYsInhtc19hY3RfZmN0IjoiMyA5IiwieG1zX2Z0ZCI6ImdINUJ3dG92S2dMMHNNLUFmOVRma0tJYU93SF9MeWV5c1hXYlhGczJ3OEFCZFhObFlYTjBMV1J6YlhNIiwieG1zX2lkcmVsIjoiMjQgNyIsInhtc19wZnRleHAiOjE3ODE2NTU0MDksInhtc19yZCI6IjAuNDJMallCSmllczhrSk1MQkxpUWdKNzlwX3I3djNBNjcxX3c3T1YxMmNwdVFDQWVua0VEVXEzMTVoWGFKenB0VS1wcnp6djA5THlUQ3dTRWt3TXdBQVFlZ3RKQUlCN2VRd0NMSkl0OTNqQXV5SnY4MTNOc2UtZlVFQUEiLCJ4bXNfc3ViX2ZjdCI6IjMgOSIsInhtc190Y2R0IjoxNzgxNTQyODQyLCJ4bXNfdG50X2ZjdCI6IjEwIDMifQ.khDvqP1r1vXVLbDKZ1fE7MASxi4ZjObri-Fc6XjXTyci1mld7vBpbwUfjn-jFh9wiWVTgV6FVILaW35ldZmGnLDSub-GxMy1aawrXFSELyonMy7O6VSYN85BhzFt2N8mYqilIFvLVr9jle9TR-aamyCabOWL2dhMWJahfUWWVmgC6jPeJhxOEpB65kE93R2WH8aC19wx1qrfB4iofwe2DFVa_vxC4OYemyM5KjmGPXTqgd4ZSJbvuirP9G8G3gMtTyMQcyhWh9Cfc57SHHiHyGbarv5quOKNOWMWNoYgloLEHdmdpXi_XEYxlRcK5zk50RSEkObXGaulJFnP-pVQnA', 'token_source': 'identity_provider'}
: mwhipplebos_hotmail.com#EXT#@mwhippleboshotmail.onmicrosoft.com Matt Whipple 4c5587fc-957b-41e8-be8b-f54331deb9b5
      user = await client.users.by_user_id('mwhipplebos_hotmail.com#EXT#@mwhippleboshotmail.onmicrosoft.com').get()

  async def get_user():
      user = await client.users.by_user_id('4c5587fc-957b-41e8-be8b-f54331deb9b5').get()
      if user:
          print(user.user_principal_name, user.display_name, user.id)
  asyncio.run(get_user())


  client = GraphServiceClient(credentials=credential, scopes=scopes)
  # GET /me
  async def me():
      me = await client.me.get()
      if me:
          print(me.display_name)
  async def get_user():
      user = await client.users.by_user_id('4c5587fc-957b-41e8-be8b-f54331deb9b5').get()

      if user:
          print(user.user_principal_name, user.display_name, user.id)
  asyncio.run(get_user())


#+RESULTS:
: 05932486-83d0-4b5b-9d23-b3a23a41e8cb

* o365

I'm also having a bunch of errors on the site itself which does not inspire confidence.

Creating an azure account...

Configuring an azure account unlocks the Entra ID management screen.

* [[id:A3C4A953-79CA-4160-AB26-A6EDCCD8AC09][Setup the Environment]]

#+begin_src shell :session venv-setup :results output
  ${host_py} -m venv ${venv}
  ${venv_py} -m pip install o365
#+end_src

#+RESULTS:
#+begin_example
host_py='python3'
venv='/tmp/o365'
venv_py='/tmp/o365/bin/python'
${host_py} -m venv ${venv}
${venv_py} -m pip install o365
Collecting o365
  Downloading o365-2.1.9-py3-none-any.whl.metadata (3.6 kB)
WARNING: Cache entry deserialization failed, entry ignored
Collecting beautifulsoup4>=4.12.3 (from o365)
  Downloading beautifulsoup4-4.15.0-py3-none-any.whl.metadata (3.8 kB)
Collecting msal>=1.31.1 (from o365)
  Downloading msal-1.37.0-py3-none-any.whl.metadata (11 kB)
WARNING: Cache entry deserialization failed, entry ignored
Collecting python-dateutil>=2.9.0.post0 (from o365)
  Using cached python_dateutil-2.9.0.post0-py2.py3-none-any.whl.metadata (8.4 kB)
Collecting requests>=2.32.3 (from o365)
  Using cached requests-2.34.2-py3-none-any.whl.metadata (4.8 kB)
Collecting tzdata>=2024.2 (from o365)
  Downloading tzdata-2026.2-py2.py3-none-any.whl.metadata (1.4 kB)
Collecting tzlocal>=5.2 (from o365)
  Downloading tzlocal-5.4-py3-none-any.whl.metadata (7.7 kB)
WARNING: Cache entry deserialization failed, entry ignored
Collecting soupsieve>=1.6.1 (from beautifulsoup4>=4.12.3->o365)
  Using cached soupsieve-2.8.4-py3-none-any.whl.metadata (4.6 kB)
Collecting typing-extensions>=4.0.0 (from beautifulsoup4>=4.12.3->o365)
  Using cached typing_extensions-4.15.0-py3-none-any.whl.metadata (3.3 kB)
Collecting PyJWT<3,>=1.0.0 (from PyJWT[crypto]<3,>=1.0.0->msal>=1.31.1->o365)
  Using cached pyjwt-2.13.0-py3-none-any.whl.metadata (3.4 kB)
Collecting cryptography<51,>=2.5 (from msal>=1.31.1->o365)
  Using cached cryptography-49.0.0-cp311-abi3-macosx_11_0_arm64.whl.metadata (4.3 kB)
Collecting cffi>=2.0.0 (from cryptography<51,>=2.5->msal>=1.31.1->o365)
  Using cached cffi-2.0.0-cp314-cp314-macosx_11_0_arm64.whl.metadata (2.6 kB)
Collecting charset_normalizer<4,>=2 (from requests>=2.32.3->o365)
  Using cached charset_normalizer-3.4.7-cp314-cp314-macosx_10_15_universal2.whl.metadata (40 kB)
Collecting idna<4,>=2.5 (from requests>=2.32.3->o365)
  Using cached idna-3.18-py3-none-any.whl.metadata (6.1 kB)
Collecting urllib3<3,>=1.26 (from requests>=2.32.3->o365)
  Using cached urllib3-2.7.0-py3-none-any.whl.metadata (6.9 kB)
Collecting certifi>=2023.5.7 (from requests>=2.32.3->o365)
  Using cached certifi-2026.5.20-py3-none-any.whl.metadata (2.5 kB)
Collecting pycparser (from cffi>=2.0.0->cryptography<51,>=2.5->msal>=1.31.1->o365)
  Using cached pycparser-3.0-py3-none-any.whl.metadata (8.2 kB)
WARNING: Cache entry deserialization failed, entry ignored
Collecting six>=1.5 (from python-dateutil>=2.9.0.post0->o365)
  Using cached six-1.17.0-py2.py3-none-any.whl.metadata (1.7 kB)
Downloading o365-2.1.9-py3-none-any.whl (160 kB)
Downloading beautifulsoup4-4.15.0-py3-none-any.whl (109 kB)
Downloading msal-1.37.0-py3-none-any.whl (123 kB)
Using cached cryptography-49.0.0-cp311-abi3-macosx_11_0_arm64.whl (4.0 MB)
Using cached pyjwt-2.13.0-py3-none-any.whl (31 kB)
Using cached requests-2.34.2-py3-none-any.whl (73 kB)
Using cached charset_normalizer-3.4.7-cp314-cp314-macosx_10_15_universal2.whl (309 kB)
Using cached idna-3.18-py3-none-any.whl (65 kB)
Using cached urllib3-2.7.0-py3-none-any.whl (131 kB)
Using cached certifi-2026.5.20-py3-none-any.whl (134 kB)
Using cached cffi-2.0.0-cp314-cp314-macosx_11_0_arm64.whl (181 kB)
Using cached python_dateutil-2.9.0.post0-py2.py3-none-any.whl (229 kB)
Using cached six-1.17.0-py2.py3-none-any.whl (11 kB)
Using cached soupsieve-2.8.4-py3-none-any.whl (37 kB)
Using cached typing_extensions-4.15.0-py3-none-any.whl (44 kB)
Downloading tzdata-2026.2-py2.py3-none-any.whl (349 kB)
Downloading tzlocal-5.4-py3-none-any.whl (28 kB)
Using cached pycparser-3.0-py3-none-any.whl (48 kB)
Installing collected packages: urllib3, tzlocal, tzdata, typing-extensions, soupsieve, six, PyJWT, pycparser, idna, charset_normalizer, certifi, requests, python-dateutil, cffi, beautifulsoup4, cryptography, msal, o365


Successfully installed PyJWT-2.13.0 beautifulsoup4-4.15.0 certifi-2026.5.20 cffi-2.0.0 charset_normalizer-3.4.7 cryptography-49.0.0 idna-3.18 msal-1.37.0 o365-2.1.9 pycparser-3.0 python-dateutil-2.9.0.post0 requests-2.34.2 six-1.17.0 soupsieve-2.8.4 typing-extensions-4.15.0 tzdata-2026.2 tzlocal-5.4 urllib3-2.7.0

[notice] A new release of pip is available: 26.1.1 -> 26.1.2
[notice] To update, run: /private/tmp/o365/bin/python -m pip install --upgrade pip
[?2004hecho 'ob_comint_async_shell_end_0bd9768d-f7e2-4018-b9f9-b4e23418ebdc'[?2004l
#+end_example

** Modules

#+begin_src shell
  ${venv_py} -c "help('modules o365')"
#+end_src

#+RESULTS:
#+begin_example
host_py='python3'
venv='/tmp/o365'
venv_py='/tmp/o365/bin/python'
${venv_py} -c "help('modules o365')"

Here is a list of modules whose name or summary contains 'o365'.
If there are any, enter a module name to get more help.

O365 - A simple python library to interact with Microsoft Graph and other MS api
O365.account 
O365.address_book 
O365.calendar 
O365.category 
O365.connection 
O365.directory 
O365.drive 
O365.excel - 2019-04-15
O365.groups 
O365.mailbox 
O365.message 
O365.planner 
O365.sharepoint 
O365.subscriptions 
O365.tasks - Methods for accessing MS Tasks/Todos via the MS Graph api.
O365.teams 
O365.utils 
O365.utils.attachment 
O365.utils.casing 
O365.utils.consent 
O365.utils.decorators 
O365.utils.query 
O365.utils.range 
O365.utils.token 
O365.utils.utils 
O365.utils.windows_tz - Mapping from iana timezones to windows timezones and vice versa
[?2004hecho 'ob_comint_async_shell_end_97a1a6b9-e078-4f97-be1e-a5ad4f66d9be'[?2004l
#+end_example

* Setup Credentials

- Login to Entra https://entra.microsoft.com/#home
- This requires a directory managed account (which can be done by setting up Azure)
- Add Mail.Read to start

** Load Credentials

I'll store the credentials in a local ~my.secrets.ini~ file.

*** Load Credentials Values

#+begin_src python :tangle /tmp/o365/auth.py
  import configparser
  config = configparser.ConfigParser()
  config.read('my.secrets.ini')

  from O365 import Account
  auth_config = config['auth']
  tenant_id=auth_config['tenant_id']
  client_id=auth_config['client_id']
  client_secret=auth_config['client_secret_value']
  credentials = (client_id, client_secret)
#+end_src
